УправлениеИТФирмой_First/src/Documents/НачислениеПоОкладу/НачислениеПоОкладу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПоОкладу</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеИТФирмой_First/src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.Календарь</schedule>
  <scheduleValue>InformationRegister.Календарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.НачисленияУдержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

УправлениеИТФирмой_First/src/Documents/НачислениеПоОкладу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Оклад КАК Оклад,
	|	НачислениеПоОкладуСотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.НачислениеПоОкладу.Сотрудники КАК НачислениеПоОкладуСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО НачислениеПоОкладуСотрудники.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	НачислениеПоОкладуСотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОкладыСотрудников = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		ОкладыСотрудников.Вставить(Выборка.Сотрудник, Выборка.Оклад);
	КонецЦикла;
	
	// регистр Зарплата
	Движения.Зарплата.Очистить();
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
	КонецЦикла;
	
	Движения.Зарплата.Записать(); 
	
	Для Каждого Движение Из Движения.Зарплата Цикл
		
		Если Движение.ВидРасчета <> ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Регистратор, Сотрудник", Ссылка,Движение.Сотрудник);
		Норма = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор,
		ВидПериодаРегистраРасчета.ПериодДействия)[0].РабочийДень;
		
		Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор,
		ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочийДень;
		
		Движение.Сумма = ?(Норма = 0, 0 , ОкладыСотрудников.Получить(Движение.Сотрудник) * Факт / Норма);
		//Результат = Движение.Сумма * Факт / Норма;
		//Движение.Сумма = Результат;
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);

КонецПроцедуры
